library(stringr)
library(dplyr)


taipei_accidents_zh <- taipei_accidents_df |>
  
  # convert codes to values
  mutate(
         # convert 民國to 西元
         發生年度 =  發生年度 + 1911,
         區序 = str_remove(區序, "\\d+"),
         車種 = case_match(車種,
                           "A01" ~ "大客車 - 公營公車",
                         "A02" ~ "大客車 - 民營公車",
                         "A03" ~ "大客車 - 公營客運",
                         "A04" ~ "大客車 - 民營客運",
                         "A05" ~ "大客車 - 遊覽車",
                         "A06" ~ "大客車 - 自用大客車",
                         
                         "A11" ~ "大貨車 - 營業用",
                         "A12" ~ "大貨車 - 自用",
                         
                         "A21" ~ "全聯結車 - 營業用",
                         "A22" ~ "全聯結車 - 自用",
                         
                         "A31" ~ "半聯結車 - 營業用",
                         "A32" ~ "半聯結車 - 自用",
                         
                         "A41" ~ "曳引車 - 營業用",
                         "A42" ~ "曳引車 - 自用",
                         
                         "B01" ~ "小客車 - 計程車",
                         "B02" ~ "小客車 - 租賃車",
                         "B03" ~ "小客車 - 自用",
                         
                         "B11" ~ "小貨車(含客、貨 兩用) - 營業用",
                         "B12" ~ "小貨車(含客、貨 兩用) - 自用",
                         "B13" ~ "小貨車(含客、貨 兩用) - 租賃小貨車",
                         
                         "C01" ~ "機車 - 大型重型1(550C.C.以上)",
                         "C02" ~ "機車 - 大型重型2(250-550C.C.)",
                         "C03" ~ "機車 - 普通重型",
                         "C04" ~ "機車 - 普通輕型",
                         "C05" ~ "機車 - 小型輕型",
                         
                         "D01" ~ "軍車 - 大客車",
                         "D02" ~ "軍車 - 載重車",
                         "D03" ~ "軍車 - 小型車",
                         
                         "E01" ~ "特種車 - 救護車",
                         "E02" ~ "特種車 - 消防車",
                         "E03" ~ "特種車 - 警備車",
                         "E04" ~ "特種車 - 工程車",
                         "E05" ~ "特種車 - 其他特種車",
                         
                         "F01" ~ "慢車 - 腳踏自行車",
                         "F02" ~ "慢車 - 電動輔助自行車",
                         "F03" ~ "慢車 - 電動自行車",
                         "F04" ~ "慢車 - 人力車",
                         "F05" ~ "慢車 - 獸力車",
                         "F06" ~ "慢車 - 其他慢車",
                         "F07" ~ "慢車 - 個人行動運具",
                         
                         "G01" ~ "其他車 - 拼裝車",
                         "G02" ~ "其他車 - 農耕用車(或機械)",
                         "G03" ~ "其他車 - 動力機械",
                         "G04" ~ "其他車 - 拖車(架)",
                         "G05" ~ "其他車 - 火車",
                         "G06" ~ "其他車 - 其他車",
                         
                         "H01" ~ "人 - 行人",
                         "H02" ~ "人 - 乘客",
                         "H03" ~ "人 - 其他人",
                         "H04" ~ "人 - 輔助代步器材",
                         .default = 車種),
         
         
         
         性別 = case_match(性別,
                         1 ~ "男",
                         2 ~ "女",
                         3 ~ "無或物(動物、堆置物)",
                         4 ~ "肇事逃逸尚未查獲",
                         5 ~ "無人駕駛自動車"),
         
         
         
         受傷程度 = case_match(受傷程度,
                       1 ~ "頭部",
                       2 ~ "頸部",
                       3 ~ "胸部",
                       4 ~ "腹部",
                       5 ~ "腰部"),
         
         
         天候 = case_match(天候,
                         1 ~ "暴雨",
                         2 ~ "強風",
                         3 ~ "風沙",
                         4 ~ "霧或煙",
                         5 ~ "雪",
                         6 ~ "雨",
                         7 ~ "陰",
                         8 ~ "晴",
                         9 ~ "風"),
         
         
         道路型態 = case_match(道路型態,
                           3 ~ "三岔路",
                           4 ~ "四岔路",
                           5 ~ ""
                           .default = as.character(道路型態)
                           )
         
         
         
         
         
         
         
         )


