library(stringr)
library(dplyr)


taipei_accidents_zh <- taipei_accidents_df |>
  
  # convert codes to values
  mutate(
         # convert 民國to 西元
         發生年度 =  發生年度 + 1911,
         發生日期 = as.Date(paste(發生年度, 發生月, 發生日, sep = "-")),
         區序 = str_remove(區序, "\\d+"),
         車種 = case_match(車種,
                           "A01" ~ "大客車 - 公營公車",
                         "A02" ~ "大客車 - 民營公車",
                         "A03" ~ "大客車 - 公營客運",
                         "A04" ~ "大客車 - 民營客運",
                         "A05" ~ "大客車 - 遊覽車",
                         "A06" ~ "大客車 - 自用大客車",
                         
                         "A11" ~ "大貨車 - 營業用",
                         "A12" ~ "大貨車 - 自用",
                         
                         "A21" ~ "全聯結車 - 營業用",
                         "A22" ~ "全聯結車 - 自用",
                         
                         "A31" ~ "半聯結車 - 營業用",
                         "A32" ~ "半聯結車 - 自用",
                         
                         "A41" ~ "曳引車 - 營業用",
                         "A42" ~ "曳引車 - 自用",
                         
                         "B01" ~ "小客車 - 計程車",
                         "B02" ~ "小客車 - 租賃車",
                         "B03" ~ "小客車 - 自用",
                         
                         "B11" ~ "小貨車(含客、貨 兩用) - 營業用",
                         "B12" ~ "小貨車(含客、貨 兩用) - 自用",
                         "B13" ~ "小貨車(含客、貨 兩用) - 租賃小貨車",
                         
                         "C01" ~ "機車 - 大型重型1(550C.C.以上)",
                         "C02" ~ "機車 - 大型重型2(250-550C.C.)",
                         "C03" ~ "機車 - 普通重型",
                         "C04" ~ "機車 - 普通輕型",
                         "C05" ~ "機車 - 小型輕型",
                         
                         "D01" ~ "軍車 - 大客車",
                         "D02" ~ "軍車 - 載重車",
                         "D03" ~ "軍車 - 小型車",
                         
                         "E01" ~ "特種車 - 救護車",
                         "E02" ~ "特種車 - 消防車",
                         "E03" ~ "特種車 - 警備車",
                         "E04" ~ "特種車 - 工程車",
                         "E05" ~ "特種車 - 其他特種車",
                         
                         "F01" ~ "慢車 - 腳踏自行車",
                         "F02" ~ "慢車 - 電動輔助自行車",
                         "F03" ~ "慢車 - 電動自行車/微型電動二輪車",
                         "F04" ~ "慢車 - 人力車",
                         "F05" ~ "慢車 - 獸力車",
                         "F06" ~ "慢車 - 其他慢車",
                         "F07" ~ "慢車 - 個人行動運具",
                         
                         "G01" ~ "其他車 - 拼裝車",
                         "G02" ~ "其他車 - 農耕用車(或機械)",
                         "G03" ~ "其他車 - 動力機械",
                         "G04" ~ "其他車 - 拖車(架)",
                         "G05" ~ "其他車 - 火車",
                         "G06" ~ "其他車 - 其他車",
                         
                         "H01" ~ "人 - 行人",
                         "H02" ~ "人 - 乘客",
                         "H03" ~ "人 - 其他人",
                         "H04" ~ "人 - 輔助代步器材",
                         .default = 車種),
         
         
         
         性別 = case_match(性別,
                         1 ~ "男",
                         2 ~ "女",
                         3 ~ "無或物(動物、堆置物)",
                         4 ~ "肇事逃逸尚未查獲",
                         5 ~ "無人駕駛自動車"),
         
         
         
         受傷程度 = case_match(受傷程度,
                       1 ~ "頭部",
                       2 ~ "頸部",
                       3 ~ "胸部",
                       4 ~ "腹部",
                       5 ~ "腰部"),
         
         
         天候 = case_match(天候,
                         1 ~ "暴雨",
                         2 ~ "強風",
                         3 ~ "風沙",
                         4 ~ "霧或煙",
                         5 ~ "雪",
                         6 ~ "雨",
                         7 ~ "陰",
                         8 ~ "晴",
                         9 ~ "風"),
         
         # Taipei Changed their form on July 1st, 2023 and what the categories
         # mean changed then too
         道路型態 = ifelse(發生日期 > "2023-07-01", 
                          case_match(道路型態,
                           3 ~ "三岔路",
                           4 ~ "四岔路",
                           5 ~ "多岔路", 
                           6 ~ "隧道",
                           7 ~ "地下道",
                           8 ~ "橋樑",
                           9 ~ "涵洞",
                           10 ~ "高架道路",
                           11 ~ "彎曲路及附近",
                           12 ~ "坡路",
                           13 ~ "巷弄",
                           14 ~ "直路",
                          # 15 ~ "廣場",
                         #  16 ~ "休息站或服務區",
                          # 17 ~ "輕軌共用道路",
                           18 ~ "圓環",
                           19 ~ "廣場",
                           20 ~ "休息站或服務區",
                           21 ~ "輕軌共用道路",
                           22 ~ "其他",
                           .default = as.character(道路型態)
                           ),
                       
                       case_match(道路型態,
                                  3 ~ "三岔路",
                                  4 ~ "四岔路",
                                  5 ~ "多岔路", 
                                  6 ~ "隧道",
                                  7 ~ "地下道",
                                  8 ~ "橋樑",
                                  9 ~ "涵洞",
                                  10 ~ "高架道路",
                                  11 ~ "彎曲路及附近",
                                  12 ~ "坡路",
                                  13 ~ "巷弄",
                                  14 ~ "直路",
                                  15 ~ "其他",
                                  16 ~ "圓環",
                                  17 ~ "廣場",
                                  .default = as.character(道路型態)
                       )),
         
         
         
         事故位置 = case_match(事故位置, 
                           1 ~ "交岔路口內",
                           2 ~ "交岔口附近",
                           3 ~ "機慢車待轉區",
                           4 ~ "機慢車停等區", 
                           5 ~ "交通島(含槽化線",
                           6 ~ "迴轉道",
                           7 ~ "快車道",
                           8 ~ "慢車道", 
                           9 ~ "一般車道(未劃分快慢車道)",
                           10 ~ "公車專用道",
                           11 ~ "機車專用道",
                           12 ~ "機車優先道",
                           13 ~ "路肩、路緣",
                           14 ~ "加速車道",
                           15 ~ "減速車道",
                           16 ~ "直線匝道",
                           17 ~ "環道匝道",
                           18 ~ "行人穿越道",
                           19 ~ "行人穿越道附近",
                           20 ~ "人行道",
                           21 ~ "收費站附近",
                           22 ~ "其他",
                           23 ~ "自行車專用道",
                           24 ~ "人行道標線",
                           25 ~ "騎樓", 
                           .default = as.character(道路型態)
                           
                           ),
         
         光線 = case_match(光線,
                         1 ~ "日間自然光線",
                         2 ~ "晨或暮光",
                         3 ~ "夜間(隧道地下道涵洞)有照明",
                         4 ~ "夜間(隧道地下道涵洞)無照明",
                         5 ~ "有照明且開啟",
                         6 ~ "有照明未開啟或障",
                         7 ~ "無照明", 
                         .default = as.character(光線)),
         
         
        道路類別 = case_match(道路類別,
                          1 ~ "國道",
                          2 ~ "省道",
                          3 ~ "縣道",
                          4 ~ "鄉道",
                          5 ~ "市區道路",
                          6 ~ "村里道路",
                          7 ~ "專用道路",
                          8 ~ "其他",
                          9 ~ "快速(公)道路", 
                          .default = as.character(道路類別)),
        
        
        路面鋪裝 = case_match(路面狀況1,
                          1 ~ "柏油",
                          2 ~ "水泥",
                          3 ~ "碎石", 
                          4 ~ "其他鋪裝",
                          5 ~ "無鋪裝"),
        
        
        路面狀態  = case_match(路面狀況2,
                          1 ~ "冰雪",
                          2 ~ "油滑",
                          3 ~ "泥濘", 
                          4 ~ "濕潤",
                          5 ~ "乾燥"),
        
        
        路面缺陷  = case_match(路面狀況3,
                           1 ~ "路面鬆軟",
                           2 ~ "突出(高低)不平",
                           3 ~ "有坑洞", 
                           4 ~ "無缺陷",
                           5 ~ "隆起或凹陷不平")
        
        
        
        
                       
         
         
         
         
         
         
         
         )


